#pragma once
/* ------------------ */


//0x380 bytes (sizeof)
struct _MI_RESAVAIL_TRACKER
{
    ULONGLONG AllocateKernelStack;                                          //0x0
    ULONGLONG AllocateGrowKernelStack;                                      //0x8
    ULONGLONG FreeKernelStack;                                              //0x10
    ULONGLONG FreeKernelStackError;                                         //0x18
    ULONGLONG FreeGrowKernelStackError;                                     //0x20
    ULONGLONG AllocateCreateProcess;                                        //0x28
    ULONGLONG FreeCreateProcessError;                                       //0x30
    ULONGLONG FreeDeleteProcess;                                            //0x38
    ULONGLONG FreeCleanProcess;                                             //0x40
    ULONGLONG FreeCleanProcessError;                                        //0x48
    ULONGLONG AllocateAddProcessWsMetaPage;                                 //0x50
    ULONGLONG AllocateWsIncrease;                                           //0x58
    ULONGLONG FreeWsIncreaseError;                                          //0x60
    ULONGLONG FreeWsIncreaseErrorMax;                                       //0x68
    ULONGLONG FreeWsDecrease;                                               //0x70
    ULONGLONG AllocateWorkingSetPage;                                       //0x78
    ULONGLONG FreeWorkingSetPageError;                                      //0x80
    ULONGLONG FreeDeletePteRange;                                           //0x88
    ULONGLONG AllocatePageTablesForProcessMetadata;                         //0x90
    ULONGLONG FreePageTablesForProcessMetadataError2;                       //0x98
    ULONGLONG AllocatePageTablesForSystem;                                  //0xa0
    ULONGLONG FreePageTablesExcess;                                         //0xa8
    ULONGLONG FreeSystemVaPageTables;                                       //0xb0
    ULONGLONG FreeSessionVaPageTables;                                      //0xb8
    ULONGLONG AllocateCreateSession;                                        //0xc0
    ULONGLONG FreeSessionWsDereference;                                     //0xc8
    ULONGLONG FreeSessionDereference;                                       //0xd0
    ULONGLONG AllocateLockedSessionImage;                                   //0xd8
    ULONGLONG FreeLockedSessionImage;                                       //0xe0
    ULONGLONG FreeSessionImageConversion;                                   //0xe8
    ULONGLONG AllocateWsAdjustPageTable;                                    //0xf0
    ULONGLONG FreeWsAdjustPageTable;                                        //0xf8
    ULONGLONG FreeWsAdjustPageTableError;                                   //0x100
    ULONGLONG AllocateNoLowMemory;                                          //0x108
    ULONGLONG AllocatePagedPoolLockedDown;                                  //0x110
    ULONGLONG FreePagedPoolLockedDown;                                      //0x118
    ULONGLONG AllocateSystemBitmaps;                                        //0x120
    ULONGLONG FreeSystemBitmapsError;                                       //0x128
    ULONGLONG AllocateForMdl;                                               //0x130
    ULONGLONG FreeFromMdl;                                                  //0x138
    ULONGLONG AllocateForMdlPartition;                                      //0x140
    ULONGLONG FreeFromMdlPartition;                                         //0x148
    ULONGLONG FreeMdlExcess;                                                //0x150
    ULONGLONG AllocateExpansionNonPagedPool;                                //0x158
    ULONGLONG FreeExpansionNonPagedPool;                                    //0x160
    ULONGLONG AllocateVad;                                                  //0x168
    ULONGLONG RemoveVad;                                                    //0x170
    ULONGLONG FreeVad;                                                      //0x178
    ULONGLONG AllocateContiguous;                                           //0x180
    ULONGLONG FreeContiguousPages;                                          //0x188
    ULONGLONG FreeContiguousError;                                          //0x190
    ULONGLONG FreeLargePageMemory;                                          //0x198
    ULONGLONG AllocateSystemWsles;                                          //0x1a0
    ULONGLONG FreeSystemWsles;                                              //0x1a8
    ULONGLONG AllocateSystemInitWs;                                         //0x1b0
    ULONGLONG AllocateSessionInitWs;                                        //0x1b8
    ULONGLONG FreeSessionInitWsError;                                       //0x1c0
    ULONGLONG AllocateSystemImage;                                          //0x1c8
    ULONGLONG AllocateSystemImageLoad;                                      //0x1d0
    ULONGLONG AllocateSessionSharedImage;                                   //0x1d8
    ULONGLONG FreeSystemImageInitCode;                                      //0x1e0
    ULONGLONG FreeSystemImageLargePageConversion;                           //0x1e8
    ULONGLONG FreeSystemImageError;                                         //0x1f0
    ULONGLONG FreeSystemImageLoadExcess;                                    //0x1f8
    ULONGLONG FreeUnloadSystemImage;                                        //0x200
    ULONGLONG FreeReloadBootImageLarge;                                     //0x208
    ULONGLONG FreeIndependent;                                              //0x210
    ULONGLONG AllocateHotRemove;                                            //0x218
    ULONGLONG FreeHotAdd;                                                   //0x220
    ULONGLONG AllocateBoot;                                                 //0x228
    ULONGLONG FreeLoaderBlock;                                              //0x230
    ULONGLONG AllocateNonPagedSpecialPool;                                  //0x238
    ULONGLONG FreeNonPagedSpecialPoolError;                                 //0x240
    ULONGLONG FreeNonPagedSpecialPool;                                      //0x248
    ULONGLONG AllocateSharedSegmentPage;                                    //0x250
    ULONGLONG FreeSharedSegmentPage;                                        //0x258
    ULONGLONG AllocateZeroPage;                                             //0x260
    ULONGLONG FreeZeroPage;                                                 //0x268
    ULONGLONG AllocateForPo;                                                //0x270
    ULONGLONG AllocateForPoForce;                                           //0x278
    ULONGLONG FreeForPo;                                                    //0x280
    ULONGLONG AllocateThreadHardFaultBehavior;                              //0x288
    ULONGLONG FreeThreadHardFaultBehavior;                                  //0x290
    ULONGLONG ObtainFaultCharges;                                           //0x298
    ULONGLONG FreeFaultCharges;                                             //0x2a0
    ULONGLONG AllocateStoreCharges;                                         //0x2a8
    ULONGLONG FreeStoreCharges;                                             //0x2b0
    ULONGLONG ObtainLockedPageCharge;                                       //0x2c0
    ULONGLONG FreeLockedPageCharge;                                         //0x300
    ULONGLONG AllocateStore;                                                //0x308
    ULONGLONG FreeStore;                                                    //0x310
    ULONGLONG AllocateSystemImageProtos;                                    //0x318
    ULONGLONG FreeSystemImageProtos;                                        //0x320
    ULONGLONG AllocateModWriterCharge;                                      //0x328
    ULONGLONG FreeModWriterCharge;                                          //0x330
    ULONGLONG AllocateMappedWriterCharge;                                   //0x338
    ULONGLONG FreeMappedWriterCharge;                                       //0x340
    ULONGLONG AllocateRegistryCharges;                                      //0x348
    ULONGLONG FreeRegistryCharges;                                          //0x350
};
/* Used in */
// _MI_SYSTEM_INFORMATION

