#pragma once
/* ------------------ */


//0x200 bytes (sizeof)
struct _MI_RESAVAIL_TRACKER
{
    ULONG AllocateKernelStack;                                              //0x0
    ULONG AllocateGrowKernelStack;                                          //0x4
    ULONG FreeKernelStack;                                                  //0x8
    ULONG FreeKernelStackError;                                             //0xc
    ULONG FreeGrowKernelStackError;                                         //0x10
    ULONG AllocateCreateProcess;                                            //0x14
    ULONG FreeCreateProcessError;                                           //0x18
    ULONG FreeDeleteProcess;                                                //0x1c
    ULONG FreeCleanProcess;                                                 //0x20
    ULONG FreeCleanProcessError;                                            //0x24
    ULONG AllocateAddProcessWsMetaPage;                                     //0x28
    ULONG AllocateWsIncrease;                                               //0x2c
    ULONG FreeWsIncreaseError;                                              //0x30
    ULONG FreeWsIncreaseErrorMax;                                           //0x34
    ULONG FreeWsDecrease;                                                   //0x38
    ULONG AllocateWorkingSetPage;                                           //0x3c
    ULONG FreeWorkingSetPageError;                                          //0x40
    ULONG FreeDeletePteRange;                                               //0x44
    ULONG AllocatePageTablesForProcessMetadata;                             //0x48
    ULONG FreePageTablesForProcessMetadataError2;                           //0x4c
    ULONG AllocatePageTablesForSystem;                                      //0x50
    ULONG FreePageTablesExcess;                                             //0x54
    ULONG FreeSystemVaPageTables;                                           //0x58
    ULONG FreeSessionVaPageTables;                                          //0x5c
    ULONG AllocateCreateSession;                                            //0x60
    ULONG FreeSessionWsDereference;                                         //0x64
    ULONG FreeSessionDereference;                                           //0x68
    ULONG AllocateLockedSessionImage;                                       //0x6c
    ULONG FreeLockedSessionImage;                                           //0x70
    ULONG FreeSessionImageConversion;                                       //0x74
    ULONG AllocateWsAdjustPageTable;                                        //0x78
    ULONG FreeWsAdjustPageTable;                                            //0x7c
    ULONG FreeWsAdjustPageTableError;                                       //0x80
    ULONG AllocateNoLowMemory;                                              //0x84
    ULONG AllocatePagedPoolLockedDown;                                      //0x88
    ULONG FreePagedPoolLockedDown;                                          //0x8c
    ULONG AllocateSystemBitmaps;                                            //0x90
    ULONG FreeSystemBitmapsError;                                           //0x94
    ULONG AllocateForMdl;                                                   //0x98
    ULONG FreeFromMdl;                                                      //0x9c
    ULONG AllocateForMdlPartition;                                          //0xa0
    ULONG FreeFromMdlPartition;                                             //0xa4
    ULONG FreeMdlExcess;                                                    //0xa8
    ULONG AllocateExpansionNonPagedPool;                                    //0xac
    ULONG FreeExpansionNonPagedPool;                                        //0xb0
    ULONG AllocateVad;                                                      //0xb4
    ULONG RemoveVad;                                                        //0xb8
    ULONG FreeVad;                                                          //0xbc
    ULONG AllocateContiguous;                                               //0xc0
    ULONG FreeContiguousPages;                                              //0xc4
    ULONG FreeContiguousError;                                              //0xc8
    ULONG FreeLargePageMemory;                                              //0xcc
    ULONG AllocateSystemWsles;                                              //0xd0
    ULONG FreeSystemWsles;                                                  //0xd4
    ULONG AllocateSystemInitWs;                                             //0xd8
    ULONG AllocateSessionInitWs;                                            //0xdc
    ULONG FreeSessionInitWsError;                                           //0xe0
    ULONG AllocateSystemImage;                                              //0xe4
    ULONG AllocateSystemImageLoad;                                          //0xe8
    ULONG AllocateSessionSharedImage;                                       //0xec
    ULONG FreeSystemImageInitCode;                                          //0xf0
    ULONG FreeSystemImageLargePageConversion;                               //0xf4
    ULONG FreeSystemImageError;                                             //0xf8
    ULONG FreeSystemImageLoadExcess;                                        //0xfc
    ULONG FreeUnloadSystemImage;                                            //0x100
    ULONG FreeReloadBootImageLarge;                                         //0x104
    ULONG FreeIndependent;                                                  //0x108
    ULONG AllocateHotAdd;                                                   //0x10c
    ULONG AllocateHotRemove;                                                //0x110
    ULONG FreeHotAdd;                                                       //0x114
    ULONG FreeHotAddEcc;                                                    //0x118
    ULONG FreeHotAddError;                                                  //0x11c
    ULONG FreeHotAddUnmap;                                                  //0x120
    ULONG AllocateBoot;                                                     //0x124
    ULONG FreeLoaderBlock;                                                  //0x128
    ULONG AllocateNonPagedSpecialPool;                                      //0x12c
    ULONG FreeNonPagedSpecialPoolError;                                     //0x130
    ULONG FreeNonPagedSpecialPool;                                          //0x134
    ULONG AllocateSharedSegmentPage;                                        //0x138
    ULONG FreeSharedSegmentPage;                                            //0x13c
    ULONG AllocateZeroPage;                                                 //0x140
    ULONG FreeZeroPage;                                                     //0x144
    ULONG AllocateForPo;                                                    //0x148
    ULONG AllocateForPoForce;                                               //0x14c
    ULONG FreeForPo;                                                        //0x150
    ULONG AllocateThreadHardFaultBehavior;                                  //0x154
    ULONG FreeThreadHardFaultBehavior;                                      //0x158
    ULONG ObtainFaultCharges;                                               //0x15c
    ULONG FreeFaultCharges;                                                 //0x160
    ULONG AllocateStoreCharges;                                             //0x164
    ULONG FreeStoreCharges;                                                 //0x168
    ULONG ObtainLockedPageCharge;                                           //0x180
    ULONG FreeLockedPageCharge;                                             //0x1c0
    ULONG AllocateStore;                                                    //0x1c4
    ULONG FreeStore;                                                        //0x1c8
    ULONG AllocateSystemImageProtos;                                        //0x1cc
    ULONG FreeSystemImageProtos;                                            //0x1d0
    ULONG AllocateModWriterCharge;                                          //0x1d4
    ULONG FreeModWriterCharge;                                              //0x1d8
    ULONG AllocateMappedWriterCharge;                                       //0x1dc
    ULONG FreeMappedWriterCharge;                                           //0x1e0
    ULONG AllocateRegistryCharges;                                          //0x1e4
    ULONG FreeRegistryCharges;                                              //0x1e8
};
/* Used in */
// _MI_SYSTEM_INFORMATION

